constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    minX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       186400;
    }
    maxX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       187200;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       188000;
    }
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       189600;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3200;
        startFace       191200;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3200;
        startFace       194400;
    }
)

// ************************************************************************* //
